saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
        <!-- *************************  Device 'STM32L4A6RG'  ***************************** -->
        <device Dname="STM32L4A6RG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6RGTx"><feature n="64" type="QFP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6VG'  ***************************** -->
        <device Dname="STM32L4A6VG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6VGTx"><feature n="100" type="QFP"/></variant>
          <variant Dvariant="STM32L4A6VGYx"><feature n="100" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6QG'  ***************************** -->
        <device Dname="STM32L4A6QG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6QGIx"><feature n="132" type="BGA"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6ZG'  ***************************** -->
        <device Dname="STM32L4A6ZG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6ZGTx"><feature n="144" type="QFP"/></variant>
          <variant Dvariant="STM32L4A6ZGYx"><feature n="144" type="CSP"/></variant>
        </device>

        <!-- *************************  Device 'STM32L4A6AG'  ***************************** -->
        <device Dname="STM32L4A6AG">
          <memory id="IROM1"                               start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32L4xx_1024.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32L4A6AGIx"><feature n="169" type="BGA"/></variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L4R5'  **************************** -->
      <subFamily DsubFamily="STM32L4R5">
        <processor  Dclock="120000000"/>
        <compile define="STM32L4R5xx" header="Drivers/CMSIS/Device/ST/STM32L4xx/Include/stm32l4xx.h"/>
        <debug svd="CMSIS/SVD/STM32L4R5.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32L4Rx_4Sx.dbgconf">
          __var DbgMCU_CR       = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz1 = 0x00000000;   // DGBMCU_APB1_FZ1: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB1_Fz2 = 0x00000000;   // DGBMCU_APB1_FZ2: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz  = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
          __var TraceClk_Pin    = 0x00040002;   // PE2
          __var TraceD0_Pin     = 0x00040003;   // PE3
          __var TraceD1_Pin     = 0x00040004;   // PE4
          __var TraceD2_Pin     = 0x00040005;   // PE5
          __var TraceD3_Pin     = 0x00040006;   // PE6
        </debugvars>

        <memory id="IRAM1"                                 start="0x20000000" size="0x000A0000" init="0" default="1" />
        <algorithm name="CMSIS/Flash/STM32L4Rx_SB_OPT.FLM" start="0x1FF00000" size="0x00000014"          default="0"/>
        <algorithm name="CMSIS/Flash/STM32L4Rx_DB_OPT.FLM" start="0x1FF00000" size="0x00000024"          default="0"/>

        <book name="Documentation/RM0432.pdf" title="STM32L4Rxxx and STM32L4Sxxx Reference Manual"/>
        <book name="Documentation/DS12023.pdf" title="STM32L4R5xx STM32L4R7xx STM32L4R9 Data Sheet"/>

        <!-- add device features -->

        <!-- *************************  Device 'STM32L4R5AG'  ***************************** -->
        <device Dname="STM32L4R5AG">
          <memory id="IROM1"                                    start="0x08000000" size="0x00100000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <variant Dvariant="STM32L4R5AGIx"> <feature type="BGA" n="169"/> </variant>
        </device>
        
        <!-- *************************  Device 'STM32L4R5AI'  ***************************** -->
        <device Dname="STM32L4R5AI">
          <memory id="IROM1"                                    start="0x08000000" size="0x00200000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00200000"             default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048_Dual.FLM" start="0x08000000" size="0x00200000"             default="0" />
          <variant Dvariant="STM32L4R5AIIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32L4R5QG'  ***************************** -->
        <device Dname="STM32L4R5QG">
          <memory id="IROM1"                                    start="0x08000000" size="0x00100000" startup="1" default="1" />
          <algorithm name="CMSIS/Flash/STM32L4Rx_2048.FLM"      start="0x08000000" size="0x00100000"             default="1" />
          <variant Dvariant="STM32L4R5QGIx"> <feature type="BGA" n="132"/> </variant>
        </device>

