saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
    <condition id="STM32L433 ARMCC">
      <description>STMicroelectronics STM32L433 Series Devices and ARMCC</description>
      <require condition="STM32L433"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L442 ARMCC">
      <description>STMicroelectronics STM32L442 Series Devices and ARMCC</description>
      <require condition="STM32L442"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L443 ARMCC">
      <description>STMicroelectronics STM32L443 Series Devices and ARMCC</description>
      <require condition="STM32L443"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L451 ARMCC">
      <description>STMicroelectronics STM32L451 Series Devices and ARMCC</description>
      <require condition="STM32L451"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L452 ARMCC">
      <description>STMicroelectronics STM32L452 Series Devices and ARMCC</description>
      <require condition="STM32L452"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L462 ARMCC">
      <description>STMicroelectronics STM32L462 Series Devices and ARMCC</description>
      <require condition="STM32L462"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L471 ARMCC">
      <description>STMicroelectronics STM32L471 Series Devices and ARMCC</description>
      <require condition="STM32L471"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L475 ARMCC">
      <description>STMicroelectronics STM32L475 Series Devices and ARMCC</description>
      <require condition="STM32L475"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L476 ARMCC">
      <description>STMicroelectronics STM32L476 Series Devices and ARMCC</description>
      <require condition="STM32L476"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L485 ARMCC">
      <description>STMicroelectronics STM32L485 Series Devices and ARMCC</description>
      <require condition="STM32L485"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L486 ARMCC">
      <description>STMicroelectronics STM32L486 Series Devices and ARMCC</description>
      <require condition="STM32L486"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L496 ARMCC">
      <description>STMicroelectronics STM32L496 Series Devices and ARMCC</description>
      <require condition="STM32L496"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4A6 ARMCC">
      <description>STMicroelectronics STM32L4A6 Series Devices and ARMCC</description>
      <require condition="STM32L4A6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4R5 ARMCC">
      <description>STMicroelectronics STM32L4R5 Series Devices and ARMCC</description>
      <require condition="STM32L4R5"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4R7 ARMCC">
      <description>STMicroelectronics STM32L4R7 Series Devices and ARMCC</description>
      <require condition="STM32L4R7"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4R9 ARMCC">
      <description>STMicroelectronics STM32L4R9 Series Devices and ARMCC</description>
      <require condition="STM32L4R9"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4S5 ARMCC">
      <description>STMicroelectronics STM32L4S5 Series Devices and ARMCC</description>
      <require condition="STM32L4S5"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4S7 ARMCC">
      <description>STMicroelectronics STM32L4S7 Series Devices and ARMCC</description>
      <require condition="STM32L4S7"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4S9 ARMCC">
      <description>STMicroelectronics STM32L4S9 Series Devices and ARMCC</description>
      <require condition="STM32L4S9"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <condition id="STM32L412_422 ARMCC">
      <description>STMicroelectronics STM32L412/422 Series Devices and ARMCC</description>
      <require condition="STM32L412_422"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462 ARMCC">
      <description>STMicroelectronics STM32L431/432/433/442/443/451/452/462 Series Devices and ARMCC</description>
      <require condition="STM32L431_432_433_442_443_451_452_462"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6 ARMCC">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6 Series Devices and ARMCC</description>
      <require condition="STM32L471_475_476_485_486_496_4A6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32L4R5_4R7_4R9_4S5_4S7_4S9 ARMCC">
      <description>STMicroelectronics L4R5/4R7/4R9/4S5/4S7/4S9 Series Devices and ARMCC</description>
      <require condition="STM32L4R5_4R7_4R9_4S5_4S7_4S9"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L4 CMSIS">
      <description>STMicroelectronics STM32L4 Series Devices and CMSIS-Core</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L476 CMSIS">
      <description>STMicroelectronics STM32L476 Devices and CMSIS-Core</description>
      <require condition="STM32L476"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32L4 HAL">
      <description>STMicroelectronics STM32L4 Device and HAL</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L4 HAL Common">
      <description>STMicroelectronics STM32L4 Device and HAL Common</description>
      <require condition="STM32L4"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32L4 HAL GPIO">
      <description>STMicroelectronics STM32L4 Device and HAL with GPIO</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 HAL">
      <description>STMicroelectronics STM32L496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Device and HAL</description>
      <require condition="STM32L496_4A6_4R5_4R7_4R9_4S5_4S7_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L4R9_4S9 HAL">
      <description>STMicroelectronics STM32L4R9/4S9 Device and HAL</description>
      <require condition="STM32L4R9_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L4R7_4R9_4S7_4S9 HAL">
      <description>STMicroelectronics STM32L4R7/4R9/4S7/4S9 Device and HAL</description>
      <require condition="STM32L4R7_4R9_4S7_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L433_443_476_486_496_4A6 HAL">
      <description>STMicroelectronics STM32L433/443/476/486/496/4A6 Device and HAL</description>
      <require condition="STM32L433_443_476_486_496_4A6"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 HAL">
      <description>STMicroelectronics STM32L475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Device and HAL</description>
      <require condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 HAL">
      <description>STMicroelectronics STM32L471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Device and HAL</description>
      <require condition="STM32L471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 HAL">
      <description>STMicroelectronics STM32L431/432/433/442/443/451/452/462/471/475/476/485/486/496/4A6/4R5/4R7/4R9/4S5/4S7/4S9 Device and HAL</description>
      <require condition="STM32L431_432_433_442_443_451_452_462_471_475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
