saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
    <condition id="STM32L496G-Discovery BSP IDD">
      <description>STMicroelectronics STM32L496G-Discovery BSP IDD</description>
      <require condition="STM32L4"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP IO">
      <description>STMicroelectronics STM32L496G-Discovery BSP IO</description>
      <require condition="STM32L4"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP LCD">
      <description>STMicroelectronics STM32L496G-Discovery BSP LCD</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LCD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP QSPI">
      <description>STMicroelectronics STM32L496G-Discovery BSP QSPI</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP SD">
      <description>STMicroelectronics STM32L496G-Discovery BSP SD</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP SRAM">
      <description>STMicroelectronics STM32L496G-Discovery BSP SRAM</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L496G-Discovery BSP TS">
      <description>STMicroelectronics STM32L496G-Discovery BSP TS</description>
      <require condition="STM32L4"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L496G-Discovery Joystick">
      <description>STMicroelectronics STM32L496G-Discovery Joystick</description>
      <require condition="STM32L4"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>

    <!-- STM32L4R9I-Eval BSP Conditions -->
    <condition id="STM32L4R9I-EVAL BSP">
      <description>STMicroelectronics STM32L4R9I-Eval BSP</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP Audio">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP Audio</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DFSDM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP DSI-LCD">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP DSI-LCD</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DSI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GFXMMU"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP DSI-TS">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP DSI-TS</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP EEPROM</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP IDD">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP IDD</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP IO">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP IO</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP NOR">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP NOR</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP OSPI-NOR">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP OSPI-NOR</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="OSPI"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP OSPI-RAM">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP OSPI-RAM</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="OSPI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32L4R9I-EVAL BSP RGB-LCD">
      <description>STMicroelectronics STM32L4R9I-EVAL BSP RGB-LCD</description>
      <require condition="STM32L4R9"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
