saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="Full-speed" Capiversion="2.1.0" Cversion="1.2.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 CMSIS_Driver USBD">
      <description>USB Device Full-Speed Driver for STM32L4 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_OTG_STM32L4xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host"   Csub="Full-speed" Capiversion="2.2.0" Cversion="1.1.0" condition="STM32L475_476_485_486_496_4A6_4R5_4R7_4R9_4S5_4S7_4S9 CMSIS_Driver USBH">
      <description>USB Host Full-Speed Driver for STM32L4 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32L4xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_OTG_STM32L4xx.c"/>
      </files>
    </component>

    <!-- STM32L476G-EVAL Board Support -->
    <bundle Cbundle="STM32L476G-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L476G-EVAL Board</description>
      <doc>MDK/Boards/ST/STM32L476G-EVAL/Documentation/DM00155732.pdf</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"          condition="STM32L476G-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"              condition="STM32L476G-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"             condition="STM32L476G-EVAL BSP EEPROM">
        <description>EEPROM for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Glass-LCD"          condition="STM32L476G-EVAL BSP Glass-LCD">
        <description>Glass-LCD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_glass_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32L476G-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_idd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                condition="STM32L476G-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe1600/stmpe1600.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                condition="STM32L476G-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/hx8347g/hx8347g.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                condition="STM32L476G-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI"               condition="STM32L476G-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_qspi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                 condition="STM32L476G-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32L476G-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval_sd.c"/>
        </files>
      </component>
