saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
      <component Cgroup="Drivers" Csub="SD"            condition="STM32L496G-Discovery BSP SD">
        <description>uSD for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"          condition="STM32L496G-Discovery BSP SRAM">
        <description>SRAM for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"  condition="STM32L496G-Discovery BSP TS">
        <description>Touch Screen for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L496G-Discovery/stm32l496g_discovery_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft6x06/ft6x06.c"/>
        </files>
      </component>
      <component Cgroup="LED"      Capiversion="1.0.0" condition="STM32L4 HAL GPIO">
        <description>LED Interface for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L496G-DISCO/Common/LED_STM32L496G_Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32L496G-Discovery Joystick">
        <description>Joystick Interface for STMicroelectronics STM32L496G-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32L496G-DISCO/Common/Joystick_STM32L496G_Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32L4R9I-EVAL Board -->
    <bundle Cbundle="STM32L4R9I-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L4R9I-EVAL Board</description>
      <doc></doc>
      <component Cgroup="Drivers" Csub="Basic I/O"          condition="STM32L4R9I-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"              condition="STM32L4R9I-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="DSI-LCD"            condition="STM32L4R9I-EVAL BSP DSI-LCD">
        <description>DSI-LCD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_lcd.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_dsi_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_dsi_lcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="DSI-TS"             condition="STM32L4R9I-EVAL BSP DSI-TS">
        <description>DSI-TS for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ts.h"/>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_dsi_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_dsi_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft3x67/ft3x67.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"             condition="STM32L4R9I-EVAL BSP EEPROM">
        <description>EEPROM for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="IDD"                condition="STM32L4R9I-EVAL BSP IDD">
        <description>IDD for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_idd.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_idd.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                condition="STM32L4R9I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                condition="STM32L4R9I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="OSPI-NOR"           condition="STM32L4R9I-EVAL BSP OSPI-NOR">
        <description>OSPI-NOR Flash for STMicroelectronics STM32L4R9I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32L4R9I_EVAL/stm32l4r9i_eval_ospi_nor.c"/>
          <!--file category="source" name="Drivers/BSP/Components/mx25lm51245g/mx25lm51245g.h"/-->
        </files>
      </component>
