saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L4xx_DFP.2.1.0.pdsc
    <!-- STM32L496G-Discovery Board Support -->
    <board vendor="STMicroelectronics" name="STM32L496G-Discovery" revision="Rev.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L496G-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g_disco_small.jpg"
             large="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g_disco_large.jpg"/>
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/32l496gdiscovery.html" title="STM32L496G-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00285842.pdf" title="Getting Started"/>
      <!--book category="schematic" name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_sch.zip" title="Schematics"/-->
      <book category="manual"    name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/DM00353127.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32L496G-DISCO/Documentation/stm32l496g-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L496AGIx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L496"/>
      <feature type="ODbg"      n="1"                name="On-board ST-LINK/V2"/>
      <feature type="ROM"       n="1"                name="64-Mbit Quad-SPI Flash memory"/>
      <feature type="MemCard"   n="1"                name="microSD card holder"/>
      <feature type="PWR"       n="5"                name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"         name="External Supply"/>
      <feature type="USB"       n="1"                name="USB OTG FS with Micro-AB connector"/>
      <feature type="CAN"       n="1"/>
      <feature type="GLCD"            n="1"  m="240.240" name="2.154 inch TFT color LCD with capacative touch panel"/>
      <feature type="I2C"       n="1"                name="I2C extension connector"/>
      <feature type="Button"    n="1"                name="Reset push button "/>
      <feature type="Joystick"  n="1"                name="4 direction-joystick with selection"/>
      <feature type="LED"       n="8"                name="2 User LEDs"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>

    <!-- STM32L4R9I-EVAL Board Support -->
    <board vendor="STMicroelectronics" name="STM32L4R9I-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32L4R9I-EVAL</description>
      <!--image small="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_small.jpg"
             large="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_large.jpg"/-->
      <!--book category="overview"  name="http://www.st.com/web/en/catalog/tools/PF261634" title="Web Page"/-->
      <!--book category="manual"    name="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/?.pdf" title="User Manual"/-->
      <book category="other"     name="MDK/Boards/ST/STM32L4R9I-EVAL/Documentation/stm32l4r9i-eval_gerber.zip" title="Gerber Files"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32L4R9AIIx"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32L4R9"/>
<!--
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Tamper and User"/>
      <feature type="LED"             n="4"              name="LEDs directly connected to port pins"/>
-->
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
  </boards>

  <examples>
    <!-- STM32L476G-EVAL Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L476G-EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L476G-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <!-- STM32L496G-Discovery Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32L496G-DISCO/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32L496G-Discovery" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

